-- 充值卡

-- 充值卡配置
g_card_list =
{
	{ 
	    id = 101,                                         -- 编号
		title = "250钻石月卡礼包",                 	    -- 标题
		type = 1,                                       -- 类型: 0 - 钻石, 1 - 月卡
		price = 1,                                     -- 人民币
		rmb = 0,                                        -- 基础钻石
		extra_rmb = 100,                                -- 额外赠送钻石  -类型为1时，月卡用户每日可领取的钻石
		first_rmb = 0,                                  -- 首充再送钻石
		recommand = 1,                                  -- 推荐标识: 1 - 推荐，0 - 不推荐
	},
	{ 
	    id = 102,                                       -- 编号
		title = "60钻石",                               -- 标题
		type = 0,                                       -- 类型: 0 - 钻石, 1 - 月卡
		price = 6,                                      -- 人民币
		rmb = 60,                                       -- 基础钻石
		extra_rmb = 5,                                  -- 额外赠送钻石  -类型为1时，月卡用户每日可领取的钻石
		first_rmb = 60,                                 -- 首充再送钻石
		recommand = 1,                                  -- 推荐标识: 1 - 推荐，0 - 不推荐
	},
	{ 
	    id = 103,                                       -- 编号
		title = "300钻石",                              -- 标题
		type = 0,                                       -- 类型: 0 - 钻石, 1 - 月卡
		price = 30,                                     -- 人民币
		rmb = 300,                                      -- 基础钻石
		extra_rmb = 15,                                 -- 额外赠送钻石  -类型为1时，月卡用户每日可领取的钻石
		first_rmb = 300,                                -- 首充再送钻石
		recommand = 1,                                  -- 推荐标识: 1 - 推荐，0 - 不推荐
	},
	{ 
	    id = 104,                                       -- 编号
		title = "980钻石",                        	    -- 标题
		type = 0,                                       -- 类型: 0 - 钻石, 1 - 月卡
		price = 98,                                     -- 人民币
		rmb = 980,                                      -- 基础钻石
		extra_rmb = 50,                                 -- 额外赠送钻石  -类型为1时，月卡用户每日可领取的钻石
		first_rmb = 980,                                -- 首充再送钻石
		recommand = 1,                                  -- 推荐标识: 1 - 推荐，0 - 不推荐
	},
		{ 
	    id = 105,                                       -- 编号
		title = "1980钻石",                        	    -- 标题
		type = 0,                                       -- 类型: 0 - 钻石, 1 - 月卡
		price = 198,                                    -- 人民币
		rmb = 1980,                                     -- 基础钻石
		extra_rmb = 100,                                -- 额外赠送钻石  -类型为1时，月卡用户每日可领取的钻石
		first_rmb = 1980,                               -- 首充再送钻石
		recommand = 0,                                  -- 推荐标识: 1 - 推荐，0 - 不推荐
	},
	{ 
	    id = 106,                                       -- 编号
		title = "3280钻石",                       	    -- 标题
		type = 0,                                       -- 类型: 0 - 钻石, 1 - 月卡
		price = 328,                                    -- 人民币
		rmb = 3280,                                     -- 基础钻石
		extra_rmb = 165,                                -- 额外赠送钻石  -类型为1时，月卡用户每日可领取的钻石
		first_rmb = 3280,                               -- 首充再送钻石
		recommand = 0,                                  -- 推荐标识: 1 - 推荐，0 - 不推荐
	},
	{ 
	    id = 107,                                       -- 编号
		title = "6480钻石",                       	    -- 标题
		type = 0,                                       -- 类型: 0 - 钻石, 1 - 月卡
		price = 648,                                    -- 人民币
		rmb = 6480,                                     -- 基础钻石
		extra_rmb = 325,                                -- 额外赠送钻石  -类型为1时，月卡用户每日可领取的钻石
		first_rmb = 6480,                               -- 首充再送钻石
		recommand = 0,                                  -- 推荐标识: 1 - 推荐，0 - 不推荐
	},
	{ 
	    id = 108,                                       -- 编号
		title = "64800钻石",                       	    -- 标题
		type = 0,                                       -- 类型: 0 - 钻石, 1 - 月卡
		price = 6480,                                   -- 人民币
		rmb = 64800,                                    -- 基础钻石
		extra_rmb = 3250,                               -- 额外赠送钻石  -类型为1时，月卡用户每日可领取的钻石
		first_rmb = 64800,                              -- 首充再送钻石
		recommand = 0,                                  -- 推荐标识: 1 - 推荐，0 - 不推荐
	},
}
	
-- 程序内部调用函数，返回充值卡列表
function lfx_recharge_get_card_list()
	return g_card_list
end
